Repository: LarissaBeatrizCosta/myapp
Catalog: lib/l10n/app_*.arb
Languages: pt

# chooseTheme
source: Choose your preferred theme
pt: Escolha o tema da sua preferência

# chooseLanguage
source: Choose your preferred language
pt: Escolha o idioma da sua preferência

source: Portuguese
pt: Português

source: English
pt: Inglês

# customersTitle
source: Registered Customers
pt: Clientes Cadastrados

# deleteCustomerTitle
source: Delete Customer
pt: Excluir Cliente

# deleteCustomerMessage
source: Do you want to delete this customer?
pt: Deseja excluir este cliente?

source: Cancel
pt: Cancelar

source: Confirm
pt: Confirmar

# welcomeBack
source: Good to have you back here!
pt: Que bom ter você novamente aqui!

source: New Registrations
pt: Novos Cadastros

source: Clients
pt: Clientes

source: Managers
pt: Gerentes

source: Vehicles
pt: Veículos

source: Rents
pt: Aluguéis

source: Reports and Changes
pt: Relatórios e Alterações

source: Registered Managers
pt: Gerentes Cadastrados

# deleteManagerTitle
source: Delete Manager
pt: Excluir Gerente

# deleteManagerMessage
source: Do you want to delete this manager?
pt: Deseja excluir este gerente?

source: Commission
pt: Comissão

# registerCustomerTitle
source: Customer Registration
pt: Cadastro de Clientes

# nameLabel
source: Name:
pt: Nome:

# phoneLabel
source: Phone:
pt: Telefone:

# stateLabel
source: State:
pt: Estado:

# cityLabel
source: City:
pt: Cidade:

source: Save
pt: Salvar

source: Customer Registered!
pt: Cliente Cadastrado!

# insertName
source: Please enter a name
pt: Insira um nome

# insertPhone
source: Please enter a phone number
pt: Insira um telefone

# phoneDigits
source: Phone number must have 10 digits
pt: O telefone precisa ter 10 dígitos

# insertCNPJ
source: Please enter a CNPJ
pt: Insira um CNPJ

# insertState
source: Please enter a state
pt: Insira um estado

# stateUF
source: Please enter the UF of your state
pt: Digite o UF de seu estado

# insertCity
source: Please enter a city
pt: Insira uma cidade

# registerManagerTitle
source: Managar Registration
pt: Cadastro De Gerentes

# insertCPF
source: Please enter a CPF
pt: Insira um CPF

# commissionPercentageLabel
source: Commission Percentage:
pt: Porcentagem de comissão:

# insertPercentage
source: Please enter a percentage
pt: Insira uma porcentagem

# percentageOnlyNumbers
source: Enter numbers only
pt: Digite apenas números

source: Manager Registered!
pt: Gerente Cadastrado!

# titleRentsRegister
source: Register Rentals
pt: Cadastro de Aluguéis

source: Select customer
pt: Selecione o cliente

source: Select state
pt: Selecione o estado

source: Select manager
pt: Selecione o gerente

source: Select vehicle
pt: Selecione o veículo

# customerValidationError
source: Select a customer
pt: Selecione o cliente

# stateValidationError
source: Select a state
pt: Selecione o estado

# managerValidationError
source: Select a manager
pt: Selecione o gerente

# vehicleValidationError
source: Select a vehicle
pt: Selecione o veículo

# rentalStartDateHint
source: Rental start date
pt: Data de início do aluguel

# rentalEndDateHint
source: Rental end date
pt: Data de final do aluguel

# priceLabel
source: Price:
pt: Preço:

# vehicleLabel
source: Vehicle
pt: Veículo

# rentalReceiptTitle
source: Rental Receipt
pt: Comprovante de Aluguel

# receiptNotFoundTitle
source: Error
pt: Erro

# receiptNotFoundMessage
source: PDF not found
pt: PDF não encontrado

# closeButton
source: Close
pt: Fechar

# rentalRegisteredMessage
source: Rental Registered!
pt: Aluguel Registrado!

# startDateValidationMessage
source: Select a start date
pt: Selecione uma data de início

# endDateValidationMessage
source: Select an end date
pt: Selecione uma data de final

# registerVehicleTitle
source: Register Vehicle
pt: Cadastro de Veículos

source: Select vehicle type
pt: Selecione o tipo de veículo

source: Vehicle type
pt: Tipo de veículo

# selectVehicleTypeValidation
source: Select a vehicle
pt: Selecione um veículo

source: Select brand
pt: Selecione a marca

source: Brand
pt: Marca

# selectBrandValidation
source: Select a brand
pt: Selecione uma marca

source: Select model
pt: Selecione o modelo

source: Model
pt: Modelo

# selectModelValidation
source: Select a model
pt: Selecione um modelo

source: Manufacturing Year
pt: Ano de fabricação

# manufacturingYearValidation
source: Enter a manufacturing year
pt: Insira um ano de fabricação

source: Plate
pt: Placa

# plateValidation
source: Enter a plate
pt: Insira uma placa

source: Daily Price
pt: Preço Diária

# dailyPriceValidation
source: Enter a daily price
pt: Insira um preço diário

source: Camera
pt: Câmera

source: Gallery
pt: Galeria

source: Attach Photos
pt: Anexar Fotos

# vehicleRegisteredMessage
source: Vehicle Registered!
pt: Veículo Registrado!

source: Registered Rents
pt: Aluguéis Cadastrados

source: Start Date
pt: Data inicial

source: Final Date
pt: Data final

source: Total Days
pt: Diárias

source: Manager
pt: Gerente

source: Total Price
pt: Valor Total

source: Delete Rent
pt: Excluir Aluguel

# confirmDeleteRent
source: Do you want to delete this rent?
pt: Deseja excluir este aluguel?
